virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/uhp.h
/*
 * Component description for UHP
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-07-26T14:35:51Z */
#ifndef _SAMG55_UHP_COMPONENT_H_
#define _SAMG55_UHP_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UHP                                          */
/* ************************************************************************** */

/* -------- UHP_HCREVISION : (UHP Offset: 0x00) ( R/ 32) OHCI Revision Number Register -------- */
#define UHP_HCREVISION_REV_Pos                _U_(0)                                               /**< (UHP_HCREVISION) OHCI revision number Position */
#define UHP_HCREVISION_REV_Msk                (_U_(0xFF) << UHP_HCREVISION_REV_Pos)                /**< (UHP_HCREVISION) OHCI revision number Mask */
#define UHP_HCREVISION_REV(value)             (UHP_HCREVISION_REV_Msk & ((value) << UHP_HCREVISION_REV_Pos))
#define UHP_HCREVISION_Msk                    _U_(0x000000FF)                                      /**< (UHP_HCREVISION) Register Mask  */


/* -------- UHP_HCCONTROL : (UHP Offset: 0x04) (R/W 32) HC Operating Mode Register -------- */
#define UHP_HCCONTROL_CBSR_Pos                _U_(0)                                               /**< (UHP_HCCONTROL) Control/bulk service ratio Position */
#define UHP_HCCONTROL_CBSR_Msk                (_U_(0x3) << UHP_HCCONTROL_CBSR_Pos)                 /**< (UHP_HCCONTROL) Control/bulk service ratio Mask */
#define UHP_HCCONTROL_CBSR(value)             (UHP_HCCONTROL_CBSR_Msk & ((value) << UHP_HCCONTROL_CBSR_Pos))
#define UHP_HCCONTROL_PLE_Pos                 _U_(2)                                               /**< (UHP_HCCONTROL) Periodic list enable Position */
#define UHP_HCCONTROL_PLE_Msk                 (_U_(0x1) << UHP_HCCONTROL_PLE_Pos)                  /**< (UHP_HCCONTROL) Periodic list enable Mask */
#define UHP_HCCONTROL_PLE(value)              (UHP_HCCONTROL_PLE_Msk & ((value) << UHP_HCCONTROL_PLE_Pos))
#define UHP_HCCONTROL_IE_Pos                  _U_(3)                                               /**< (UHP_HCCONTROL) Isochronous enable Position */
#define UHP_HCCONTROL_IE_Msk                  (_U_(0x1) << UHP_HCCONTROL_IE_Pos)                   /**< (UHP_HCCONTROL) Isochronous enable Mask */
#define UHP_HCCONTROL_IE(value)               (UHP_HCCONTROL_IE_Msk & ((value) << UHP_HCCONTROL_IE_Pos))
#define UHP_HCCONTROL_CLE_Pos                 _U_(4)                                               /**< (UHP_HCCONTROL) Control list enable Position */
#define UHP_HCCONTROL_CLE_Msk                 (_U_(0x1) << UHP_HCCONTROL_CLE_Pos)                  /**< (UHP_HCCONTROL) Control list enable Mask */
#define UHP_HCCONTROL_CLE(value)              (UHP_HCCONTROL_CLE_Msk & ((value) << UHP_HCCONTROL_CLE_Pos))
#define UHP_HCCONTROL_BLE_Pos                 _U_(5)                                               /**< (UHP_HCCONTROL) Bulk list enable Position */
#define UHP_HCCONTROL_BLE_Msk                 (_U_(0x1) << UHP_HCCONTROL_BLE_Pos)                  /**< (UHP_HCCONTROL) Bulk list enable Mask */
#define UHP_HCCONTROL_BLE(value)              (UHP_HCCONTROL_BLE_Msk & ((value) << UHP_HCCONTROL_BLE_Pos))
#define UHP_HCCONTROL_HCFS_Pos                _U_(6)                                               /**< (UHP_HCCONTROL) Host controller functional state Position */
#define UHP_HCCONTROL_HCFS_Msk                (_U_(0x3) << UHP_HCCONTROL_HCFS_Pos)                 /**< (UHP_HCCONTROL) Host controller functional state Mask */
#define UHP_HCCONTROL_HCFS(value)             (UHP_HCCONTROL_HCFS_Msk & ((value) << UHP_HCCONTROL_HCFS_Pos))
#define UHP_HCCONTROL_IR_Pos                  _U_(8)                                               /**< (UHP_HCCONTROL) Interrupt routing Position */
#define UHP_HCCONTROL_IR_Msk                  (_U_(0x1) << UHP_HCCONTROL_IR_Pos)                   /**< (UHP_HCCONTROL) Interrupt routing Mask */
#define UHP_HCCONTROL_IR(value)               (UHP_HCCONTROL_IR_Msk & ((value) << UHP_HCCONTROL_IR_Pos))
#define UHP_HCCONTROL_RWC_Pos                 _U_(9)                                               /**< (UHP_HCCONTROL) Remote wake-up connected Position */
#define UHP_HCCONTROL_RWC_Msk                 (_U_(0x1) << UHP_HCCONTROL_RWC_Pos)                  /**< (UHP_HCCONTROL) Remote wake-up connected Mask */
#define UHP_HCCONTROL_RWC(value)              (UHP_HCCONTROL_RWC_Msk & ((value) << UHP_HCCONTROL_RWC_Pos))
#define UHP_HCCONTROL_RWE_Pos                 _U_(10)                                              /**< (UHP_HCCONTROL) Remote wake-up enable Position */
#define UHP_HCCONTROL_RWE_Msk                 (_U_(0x1) << UHP_HCCONTROL_RWE_Pos)                  /**< (UHP_HCCONTROL) Remote wake-up enable Mask */
#define UHP_HCCONTROL_RWE(value)              (UHP_HCCONTROL_RWE_Msk & ((value) << UHP_HCCONTROL_RWE_Pos))
#define UHP_HCCONTROL_Msk                     _U_(0x000007FF)                                      /**< (UHP_HCCONTROL) Register Mask  */


/* -------- UHP_HCCOMMANDSTATUS : (UHP Offset: 0x08) (R/W 32) HC Command and Status Register -------- */
#define UHP_HCCOMMANDSTATUS_HCR_Pos           _U_(0)                                               /**< (UHP_HCCOMMANDSTATUS) Host controller reset (read/write) Position */
#define UHP_HCCOMMANDSTATUS_HCR_Msk           (_U_(0x1) << UHP_HCCOMMANDSTATUS_HCR_Pos)            /**< (UHP_HCCOMMANDSTATUS) Host controller reset (read/write) Mask */
#define UHP_HCCOMMANDSTATUS_HCR(value)        (UHP_HCCOMMANDSTATUS_HCR_Msk & ((value) << UHP_HCCOMMANDSTATUS_HCR_Pos))
#define UHP_HCCOMMANDSTATUS_CLF_Pos           _U_(1)                                               /**< (UHP_HCCOMMANDSTATUS) Control list filled (read/write) Position */
#define UHP_HCCOMMANDSTATUS_CLF_Msk           (_U_(0x1) << UHP_HCCOMMANDSTATUS_CLF_Pos)            /**< (UHP_HCCOMMANDSTATUS) Control list filled (read/write) Mask */
#define UHP_HCCOMMANDSTATUS_CLF(value)        (UHP_HCCOMMANDSTATUS_CLF_Msk & ((value) << UHP_HCCOMMANDSTATUS_CLF_Pos))
#define UHP_HCCOMMANDSTATUS_BLF_Pos           _U_(2)                                               /**< (UHP_HCCOMMANDSTATUS) Bulk list filled (read/write) Position */
#define UHP_HCCOMMANDSTATUS_BLF_Msk           (_U_(0x1) << UHP_HCCOMMANDSTATUS_BLF_Pos)            /**< (UHP_HCCOMMANDSTATUS) Bulk list filled (read/write) Mask */
#define UHP_HCCOMMANDSTATUS_BLF(value)        (UHP_HCCOMMANDSTATUS_BLF_Msk & ((value) << UHP_HCCOMMANDSTATUS_BLF_Pos))
#define UHP_HCCOMMANDSTATUS_OCR_Pos           _U_(3)                                               /**< (UHP_HCCOMMANDSTATUS) Ownership change request (read/write) Position */
#define UHP_HCCOMMANDSTATUS_OCR_Msk           (_U_(0x1) << UHP_HCCOMMANDSTATUS_OCR_Pos)            /**< (UHP_HCCOMMANDSTATUS) Ownership change request (read/write) Mask */
#define UHP_HCCOMMANDSTATUS_OCR(value)        (UHP_HCCOMMANDSTATUS_OCR_Msk & ((value) << UHP_HCCOMMANDSTATUS_OCR_Pos))
#define UHP_HCCOMMANDSTATUS_SOC_Pos           _U_(16)                                              /**< (UHP_HCCOMMANDSTATUS) Scheduling overrun count (read-only) Position */
#define UHP_HCCOMMANDSTATUS_SOC_Msk           (_U_(0x3) << UHP_HCCOMMANDSTATUS_SOC_Pos)            /**< (UHP_HCCOMMANDSTATUS) Scheduling overrun count (read-only) Mask */
#define UHP_HCCOMMANDSTATUS_SOC(value)        (UHP_HCCOMMANDSTATUS_SOC_Msk & ((value) << UHP_HCCOMMANDSTATUS_SOC_Pos))
#define UHP_HCCOMMANDSTATUS_Msk               _U_(0x0003000F)                                      /**< (UHP_HCCOMMANDSTATUS) Register Mask  */


/* -------- UHP_HCINTERRUPTSTATUS : (UHP Offset: 0x0C) (R/W 32) HC Interrupt and Status Register -------- */
#define UHP_HCINTERRUPTSTATUS_SO_Pos          _U_(0)                                               /**< (UHP_HCINTERRUPTSTATUS) Scheduling overrun (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_SO_Msk          (_U_(0x1) << UHP_HCINTERRUPTSTATUS_SO_Pos)           /**< (UHP_HCINTERRUPTSTATUS) Scheduling overrun (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_SO(value)       (UHP_HCINTERRUPTSTATUS_SO_Msk & ((value) << UHP_HCINTERRUPTSTATUS_SO_Pos))
#define UHP_HCINTERRUPTSTATUS_WDH_Pos         _U_(1)                                               /**< (UHP_HCINTERRUPTSTATUS) Write done head (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_WDH_Msk         (_U_(0x1) << UHP_HCINTERRUPTSTATUS_WDH_Pos)          /**< (UHP_HCINTERRUPTSTATUS) Write done head (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_WDH(value)      (UHP_HCINTERRUPTSTATUS_WDH_Msk & ((value) << UHP_HCINTERRUPTSTATUS_WDH_Pos))
#define UHP_HCINTERRUPTSTATUS_SF_Pos          _U_(2)                                               /**< (UHP_HCINTERRUPTSTATUS) Start of frame (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_SF_Msk          (_U_(0x1) << UHP_HCINTERRUPTSTATUS_SF_Pos)           /**< (UHP_HCINTERRUPTSTATUS) Start of frame (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_SF(value)       (UHP_HCINTERRUPTSTATUS_SF_Msk & ((value) << UHP_HCINTERRUPTSTATUS_SF_Pos))
#define UHP_HCINTERRUPTSTATUS_RD_Pos          _U_(3)                                               /**< (UHP_HCINTERRUPTSTATUS) Resume detected (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_RD_Msk          (_U_(0x1) << UHP_HCINTERRUPTSTATUS_RD_Pos)           /**< (UHP_HCINTERRUPTSTATUS) Resume detected (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_RD(value)       (UHP_HCINTERRUPTSTATUS_RD_Msk & ((value) << UHP_HCINTERRUPTSTATUS_RD_Pos))
#define UHP_HCINTERRUPTSTATUS_UE_Pos          _U_(4)                                               /**< (UHP_HCINTERRUPTSTATUS) Unrecoverable error (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_UE_Msk          (_U_(0x1) << UHP_HCINTERRUPTSTATUS_UE_Pos)           /**< (UHP_HCINTERRUPTSTATUS) Unrecoverable error (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_UE(value)       (UHP_HCINTERRUPTSTATUS_UE_Msk & ((value) << UHP_HCINTERRUPTSTATUS_UE_Pos))
#define UHP_HCINTERRUPTSTATUS_FNO_Pos         _U_(5)                                               /**< (UHP_HCINTERRUPTSTATUS) Frame number overflow (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_FNO_Msk         (_U_(0x1) << UHP_HCINTERRUPTSTATUS_FNO_Pos)          /**< (UHP_HCINTERRUPTSTATUS) Frame number overflow (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_FNO(value)      (UHP_HCINTERRUPTSTATUS_FNO_Msk & ((value) << UHP_HCINTERRUPTSTATUS_FNO_Pos))
#define UHP_HCINTERRUPTSTATUS_RHSC_Pos        _U_(6)                                               /**< (UHP_HCINTERRUPTSTATUS) Root hub status change (read/write, write '1' to clear) Position */
#define UHP_HCINTERRUPTSTATUS_RHSC_Msk        (_U_(0x1) << UHP_HCINTERRUPTSTATUS_RHSC_Pos)         /**< (UHP_HCINTERRUPTSTATUS) Root hub status change (read/write, write '1' to clear) Mask */
#define UHP_HCINTERRUPTSTATUS_RHSC(value)     (UHP_HCINTERRUPTSTATUS_RHSC_Msk & ((value) << UHP_HCINTERRUPTSTATUS_RHSC_Pos))
#define UHP_HCINTERRUPTSTATUS_OC_Pos          _U_(30)                                              /**< (UHP_HCINTERRUPTSTATUS) Ownership change (read-only) Position */
#define UHP_HCINTERRUPTSTATUS_OC_Msk          (_U_(0x1) << UHP_HCINTERRUPTSTATUS_OC_Pos)           /**< (UHP_HCINTERRUPTSTATUS) Ownership change (read-only) Mask */
#define UHP_HCINTERRUPTSTATUS_OC(value)       (UHP_HCINTERRUPTSTATUS_OC_Msk & ((value) << UHP_HCINTERRUPTSTATUS_OC_Pos))
#define UHP_HCINTERRUPTSTATUS_Msk             _U_(0x4000007F)                                      /**< (UHP_HCINTERRUPTSTATUS) Register Mask  */


/* -------- UHP_HCINTERRUPTENABLE : (UHP Offset: 0x10) (R/W 32) HC Interrupt Enable Register -------- */
#define UHP_HCINTERRUPTENABLE_SO_Pos          _U_(0)                                               /**< (UHP_HCINTERRUPTENABLE) Scheduling overrun (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_SO_Msk          (_U_(0x1) << UHP_HCINTERRUPTENABLE_SO_Pos)           /**< (UHP_HCINTERRUPTENABLE) Scheduling overrun (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_SO(value)       (UHP_HCINTERRUPTENABLE_SO_Msk & ((value) << UHP_HCINTERRUPTENABLE_SO_Pos))
#define UHP_HCINTERRUPTENABLE_WDH_Pos         _U_(1)                                               /**< (UHP_HCINTERRUPTENABLE) Write done head (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_WDH_Msk         (_U_(0x1) << UHP_HCINTERRUPTENABLE_WDH_Pos)          /**< (UHP_HCINTERRUPTENABLE) Write done head (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_WDH(value)      (UHP_HCINTERRUPTENABLE_WDH_Msk & ((value) << UHP_HCINTERRUPTENABLE_WDH_Pos))
#define UHP_HCINTERRUPTENABLE_SF_Pos          _U_(2)                                               /**< (UHP_HCINTERRUPTENABLE) Start of frame (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_SF_Msk          (_U_(0x1) << UHP_HCINTERRUPTENABLE_SF_Pos)           /**< (UHP_HCINTERRUPTENABLE) Start of frame (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_SF(value)       (UHP_HCINTERRUPTENABLE_SF_Msk & ((value) << UHP_HCINTERRUPTENABLE_SF_Pos))
#define UHP_HCINTERRUPTENABLE_RD_Pos          _U_(3)                                               /**< (UHP_HCINTERRUPTENABLE) Resume detected (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_RD_Msk          (_U_(0x1) << UHP_HCINTERRUPTENABLE_RD_Pos)           /**< (UHP_HCINTERRUPTENABLE) Resume detected (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_RD(value)       (UHP_HCINTERRUPTENABLE_RD_Msk & ((value) << UHP_HCINTERRUPTENABLE_RD_Pos))
#define UHP_HCINTERRUPTENABLE_UE_Pos          _U_(4)                                               /**< (UHP_HCINTERRUPTENABLE) Unrecoverable error (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_UE_Msk          (_U_(0x1) << UHP_HCINTERRUPTENABLE_UE_Pos)           /**< (UHP_HCINTERRUPTENABLE) Unrecoverable error (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_UE(value)       (UHP_HCINTERRUPTENABLE_UE_Msk & ((value) << UHP_HCINTERRUPTENABLE_UE_Pos))
#define UHP_HCINTERRUPTENABLE_FNO_Pos         _U_(5)                                               /**< (UHP_HCINTERRUPTENABLE) Frame number overflow (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_FNO_Msk         (_U_(0x1) << UHP_HCINTERRUPTENABLE_FNO_Pos)          /**< (UHP_HCINTERRUPTENABLE) Frame number overflow (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_FNO(value)      (UHP_HCINTERRUPTENABLE_FNO_Msk & ((value) << UHP_HCINTERRUPTENABLE_FNO_Pos))
#define UHP_HCINTERRUPTENABLE_RHSC_Pos        _U_(6)                                               /**< (UHP_HCINTERRUPTENABLE) Root hub status change (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_RHSC_Msk        (_U_(0x1) << UHP_HCINTERRUPTENABLE_RHSC_Pos)         /**< (UHP_HCINTERRUPTENABLE) Root hub status change (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_RHSC(value)     (UHP_HCINTERRUPTENABLE_RHSC_Msk & ((value) << UHP_HCINTERRUPTENABLE_RHSC_Pos))
#define UHP_HCINTERRUPTENABLE_OC_Pos          _U_(30)                                              /**< (UHP_HCINTERRUPTENABLE) Ownership change (read-only) Position */
#define UHP_HCINTERRUPTENABLE_OC_Msk          (_U_(0x1) << UHP_HCINTERRUPTENABLE_OC_Pos)           /**< (UHP_HCINTERRUPTENABLE) Ownership change (read-only) Mask */
#define UHP_HCINTERRUPTENABLE_OC(value)       (UHP_HCINTERRUPTENABLE_OC_Msk & ((value) << UHP_HCINTERRUPTENABLE_OC_Pos))
#define UHP_HCINTERRUPTENABLE_MIE_Pos         _U_(31)                                              /**< (UHP_HCINTERRUPTENABLE) Master interrupt enable (read/write, write '1' to set) Position */
#define UHP_HCINTERRUPTENABLE_MIE_Msk         (_U_(0x1) << UHP_HCINTERRUPTENABLE_MIE_Pos)          /**< (UHP_HCINTERRUPTENABLE) Master interrupt enable (read/write, write '1' to set) Mask */
#define UHP_HCINTERRUPTENABLE_MIE(value)      (UHP_HCINTERRUPTENABLE_MIE_Msk & ((value) << UHP_HCINTERRUPTENABLE_MIE_Pos))
#define UHP_HCINTERRUPTENABLE_Msk             _U_(0xC000007F)                                      /**< (UHP_HCINTERRUPTENABLE) Register Mask  */


/* -------- UHP_HCINTERRUPTDISABLE : (UHP Offset: 0x14) (R/W 32) HC Interrupt Disable Register -------- */
#define UHP_HCINTERRUPTDISABLE_SO_Pos         _U_(0)                                               /**< (UHP_HCINTERRUPTDISABLE) Scheduling overrun (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_SO_Msk         (_U_(0x1) << UHP_HCINTERRUPTDISABLE_SO_Pos)          /**< (UHP_HCINTERRUPTDISABLE) Scheduling overrun (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_SO(value)      (UHP_HCINTERRUPTDISABLE_SO_Msk & ((value) << UHP_HCINTERRUPTDISABLE_SO_Pos))
#define UHP_HCINTERRUPTDISABLE_WDH_Pos        _U_(1)                                               /**< (UHP_HCINTERRUPTDISABLE) Write done head (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_WDH_Msk        (_U_(0x1) << UHP_HCINTERRUPTDISABLE_WDH_Pos)         /**< (UHP_HCINTERRUPTDISABLE) Write done head (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_WDH(value)     (UHP_HCINTERRUPTDISABLE_WDH_Msk & ((value) << UHP_HCINTERRUPTDISABLE_WDH_Pos))
#define UHP_HCINTERRUPTDISABLE_SF_Pos         _U_(2)                                               /**< (UHP_HCINTERRUPTDISABLE) Start of frame (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_SF_Msk         (_U_(0x1) << UHP_HCINTERRUPTDISABLE_SF_Pos)          /**< (UHP_HCINTERRUPTDISABLE) Start of frame (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_SF(value)      (UHP_HCINTERRUPTDISABLE_SF_Msk & ((value) << UHP_HCINTERRUPTDISABLE_SF_Pos))
#define UHP_HCINTERRUPTDISABLE_RD_Pos         _U_(3)                                               /**< (UHP_HCINTERRUPTDISABLE) Resume detected (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_RD_Msk         (_U_(0x1) << UHP_HCINTERRUPTDISABLE_RD_Pos)          /**< (UHP_HCINTERRUPTDISABLE) Resume detected (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_RD(value)      (UHP_HCINTERRUPTDISABLE_RD_Msk & ((value) << UHP_HCINTERRUPTDISABLE_RD_Pos))
#define UHP_HCINTERRUPTDISABLE_UE_Pos         _U_(4)                                               /**< (UHP_HCINTERRUPTDISABLE) Unrecoverable error (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_UE_Msk         (_U_(0x1) << UHP_HCINTERRUPTDISABLE_UE_Pos)          /**< (UHP_HCINTERRUPTDISABLE) Unrecoverable error (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_UE(value)      (UHP_HCINTERRUPTDISABLE_UE_Msk & ((value) << UHP_HCINTERRUPTDISABLE_UE_Pos))
#define UHP_HCINTERRUPTDISABLE_FNO_Pos        _U_(5)                                               /**< (UHP_HCINTERRUPTDISABLE) Frame number overflow (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_FNO_Msk        (_U_(0x1) << UHP_HCINTERRUPTDISABLE_FNO_Pos)         /**< (UHP_HCINTERRUPTDISABLE) Frame number overflow (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_FNO(value)     (UHP_HCINTERRUPTDISABLE_FNO_Msk & ((value) << UHP_HCINTERRUPTDISABLE_FNO_Pos))
#define UHP_HCINTERRUPTDISABLE_RHSC_Pos       _U_(6)                                               /**< (UHP_HCINTERRUPTDISABLE) Root hub status change (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_RHSC_Msk       (_U_(0x1) << UHP_HCINTERRUPTDISABLE_RHSC_Pos)        /**< (UHP_HCINTERRUPTDISABLE) Root hub status change (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_RHSC(value)    (UHP_HCINTERRUPTDISABLE_RHSC_Msk & ((value) << UHP_HCINTERRUPTDISABLE_RHSC_Pos))
#define UHP_HCINTERRUPTDISABLE_OC_Pos         _U_(30)                                              /**< (UHP_HCINTERRUPTDISABLE) Ownership change (read-only) Position */
#define UHP_HCINTERRUPTDISABLE_OC_Msk         (_U_(0x1) << UHP_HCINTERRUPTDISABLE_OC_Pos)          /**< (UHP_HCINTERRUPTDISABLE) Ownership change (read-only) Mask */
#define UHP_HCINTERRUPTDISABLE_OC(value)      (UHP_HCINTERRUPTDISABLE_OC_Msk & ((value) << UHP_HCINTERRUPTDISABLE_OC_Pos))
#define UHP_HCINTERRUPTDISABLE_MIE_Pos        _U_(31)                                              /**< (UHP_HCINTERRUPTDISABLE) Master interrupt enable (read/write) Position */
#define UHP_HCINTERRUPTDISABLE_MIE_Msk        (_U_(0x1) << UHP_HCINTERRUPTDISABLE_MIE_Pos)         /**< (UHP_HCINTERRUPTDISABLE) Master interrupt enable (read/write) Mask */
#define UHP_HCINTERRUPTDISABLE_MIE(value)     (UHP_HCINTERRUPTDISABLE_MIE_Msk & ((value) << UHP_HCINTERRUPTDISABLE_MIE_Pos))
#define UHP_HCINTERRUPTDISABLE_Msk            _U_(0xC000007F)                                      /**< (UHP_HCINTERRUPTDISABLE) Register Mask  */


/* -------- UHP_HCHCCA : (UHP Offset: 0x18) (R/W 32) HC HCCA Address Register -------- */
#define UHP_HCHCCA_HCCA_Pos                   _U_(8)                                               /**< (UHP_HCHCCA) Physical address of the beginning of the HCCA Position */
#define UHP_HCHCCA_HCCA_Msk                   (_U_(0xFFFFFF) << UHP_HCHCCA_HCCA_Pos)               /**< (UHP_HCHCCA) Physical address of the beginning of the HCCA Mask */
#define UHP_HCHCCA_HCCA(value)                (UHP_HCHCCA_HCCA_Msk & ((value) << UHP_HCHCCA_HCCA_Pos))
#define UHP_HCHCCA_Msk                        _U_(0xFFFFFF00)                                      /**< (UHP_HCHCCA) Register Mask  */


/* -------- UHP_HCPERIODCURRENTED : (UHP Offset: 0x1C) ( R/ 32) HC Current Periodic Register -------- */
#define UHP_HCPERIODCURRENTED_PCED_Pos        _U_(4)                                               /**< (UHP_HCPERIODCURRENTED) Physical address of the current ED on the periodic ED list Position */
#define UHP_HCPERIODCURRENTED_PCED_Msk        (_U_(0xFFFFFFF) << UHP_HCPERIODCURRENTED_PCED_Pos)   /**< (UHP_HCPERIODCURRENTED) Physical address of the current ED on the periodic ED list Mask */
#define UHP_HCPERIODCURRENTED_PCED(value)     (UHP_HCPERIODCURRENTED_PCED_Msk & ((value) << UHP_HCPERIODCURRENTED_PCED_Pos))
#define UHP_HCPERIODCURRENTED_Msk             _U_(0xFFFFFFF0)                                      /**< (UHP_HCPERIODCURRENTED) Register Mask  */


