virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/uhp.h
/* -------- UHP_HCCONTROLHEADED : (UHP Offset: 0x20) (R/W 32) HC Head Control Register -------- */
#define UHP_HCCONTROLHEADED_CHED_Pos          _U_(4)                                               /**< (UHP_HCCONTROLHEADED) Physical address of the head ED on the control ED list Position */
#define UHP_HCCONTROLHEADED_CHED_Msk          (_U_(0xFFFFFFF) << UHP_HCCONTROLHEADED_CHED_Pos)     /**< (UHP_HCCONTROLHEADED) Physical address of the head ED on the control ED list Mask */
#define UHP_HCCONTROLHEADED_CHED(value)       (UHP_HCCONTROLHEADED_CHED_Msk & ((value) << UHP_HCCONTROLHEADED_CHED_Pos))
#define UHP_HCCONTROLHEADED_Msk               _U_(0xFFFFFFF0)                                      /**< (UHP_HCCONTROLHEADED) Register Mask  */


/* -------- UHP_HCCONTROLCURRENTED : (UHP Offset: 0x24) (R/W 32) HC Current Control Register -------- */
#define UHP_HCCONTROLCURRENTED_CCED_Pos       _U_(4)                                               /**< (UHP_HCCONTROLCURRENTED) Physical address of the current ED on the control ED list Position */
#define UHP_HCCONTROLCURRENTED_CCED_Msk       (_U_(0xFFFFFFF) << UHP_HCCONTROLCURRENTED_CCED_Pos)  /**< (UHP_HCCONTROLCURRENTED) Physical address of the current ED on the control ED list Mask */
#define UHP_HCCONTROLCURRENTED_CCED(value)    (UHP_HCCONTROLCURRENTED_CCED_Msk & ((value) << UHP_HCCONTROLCURRENTED_CCED_Pos))
#define UHP_HCCONTROLCURRENTED_Msk            _U_(0xFFFFFFF0)                                      /**< (UHP_HCCONTROLCURRENTED) Register Mask  */


/* -------- UHP_HCBULKHEADED : (UHP Offset: 0x28) (R/W 32) HC Head Bulk Register -------- */
#define UHP_HCBULKHEADED_BHED_Pos             _U_(4)                                               /**< (UHP_HCBULKHEADED) Physical address of the head ED on the bulk ED list Position */
#define UHP_HCBULKHEADED_BHED_Msk             (_U_(0xFFFFFFF) << UHP_HCBULKHEADED_BHED_Pos)        /**< (UHP_HCBULKHEADED) Physical address of the head ED on the bulk ED list Mask */
#define UHP_HCBULKHEADED_BHED(value)          (UHP_HCBULKHEADED_BHED_Msk & ((value) << UHP_HCBULKHEADED_BHED_Pos))
#define UHP_HCBULKHEADED_Msk                  _U_(0xFFFFFFF0)                                      /**< (UHP_HCBULKHEADED) Register Mask  */


/* -------- UHP_HCBULKCURRENTED : (UHP Offset: 0x2C) (R/W 32) HC Current Bulk Register -------- */
#define UHP_HCBULKCURRENTED_BCED_Pos          _U_(4)                                               /**< (UHP_HCBULKCURRENTED) Physical address of the current ED on the bulk ED list Position */
#define UHP_HCBULKCURRENTED_BCED_Msk          (_U_(0xFFFFFFF) << UHP_HCBULKCURRENTED_BCED_Pos)     /**< (UHP_HCBULKCURRENTED) Physical address of the current ED on the bulk ED list Mask */
#define UHP_HCBULKCURRENTED_BCED(value)       (UHP_HCBULKCURRENTED_BCED_Msk & ((value) << UHP_HCBULKCURRENTED_BCED_Pos))
#define UHP_HCBULKCURRENTED_Msk               _U_(0xFFFFFFF0)                                      /**< (UHP_HCBULKCURRENTED) Register Mask  */


/* -------- UHP_HCDONEHEAD : (UHP Offset: 0x30) ( R/ 32) HC Head Done Register -------- */
#define UHP_HCDONEHEAD_DH_Pos                 _U_(4)                                               /**< (UHP_HCDONEHEAD) Physical address of the last TD that has added to the done queue Position */
#define UHP_HCDONEHEAD_DH_Msk                 (_U_(0xFFFFFFF) << UHP_HCDONEHEAD_DH_Pos)            /**< (UHP_HCDONEHEAD) Physical address of the last TD that has added to the done queue Mask */
#define UHP_HCDONEHEAD_DH(value)              (UHP_HCDONEHEAD_DH_Msk & ((value) << UHP_HCDONEHEAD_DH_Pos))
#define UHP_HCDONEHEAD_Msk                    _U_(0xFFFFFFF0)                                      /**< (UHP_HCDONEHEAD) Register Mask  */


/* -------- UHP_HCFMINTERVAL : (UHP Offset: 0x34) (R/W 32) HC Frame Interval Register -------- */
#define UHP_HCFMINTERVAL_FRAMEINTERVAL_Pos    _U_(0)                                               /**< (UHP_HCFMINTERVAL) Frame interval Position */
#define UHP_HCFMINTERVAL_FRAMEINTERVAL_Msk    (_U_(0x3FFF) << UHP_HCFMINTERVAL_FRAMEINTERVAL_Pos)  /**< (UHP_HCFMINTERVAL) Frame interval Mask */
#define UHP_HCFMINTERVAL_FRAMEINTERVAL(value) (UHP_HCFMINTERVAL_FRAMEINTERVAL_Msk & ((value) << UHP_HCFMINTERVAL_FRAMEINTERVAL_Pos))
#define UHP_HCFMINTERVAL_FSMPS_Pos            _U_(16)                                              /**< (UHP_HCFMINTERVAL) Largest data packet Position */
#define UHP_HCFMINTERVAL_FSMPS_Msk            (_U_(0x7FFF) << UHP_HCFMINTERVAL_FSMPS_Pos)          /**< (UHP_HCFMINTERVAL) Largest data packet Mask */
#define UHP_HCFMINTERVAL_FSMPS(value)         (UHP_HCFMINTERVAL_FSMPS_Msk & ((value) << UHP_HCFMINTERVAL_FSMPS_Pos))
#define UHP_HCFMINTERVAL_FIT_Pos              _U_(31)                                              /**< (UHP_HCFMINTERVAL) Frame interval toggle Position */
#define UHP_HCFMINTERVAL_FIT_Msk              (_U_(0x1) << UHP_HCFMINTERVAL_FIT_Pos)               /**< (UHP_HCFMINTERVAL) Frame interval toggle Mask */
#define UHP_HCFMINTERVAL_FIT(value)           (UHP_HCFMINTERVAL_FIT_Msk & ((value) << UHP_HCFMINTERVAL_FIT_Pos))
#define UHP_HCFMINTERVAL_Msk                  _U_(0xFFFF3FFF)                                      /**< (UHP_HCFMINTERVAL) Register Mask  */


/* -------- UHP_HCFMREMAINING : (UHP Offset: 0x38) ( R/ 32) HC Frame Remaining Register -------- */
#define UHP_HCFMREMAINING_FR_Pos              _U_(0)                                               /**< (UHP_HCFMREMAINING) Frame remaining Position */
#define UHP_HCFMREMAINING_FR_Msk              (_U_(0x3FFF) << UHP_HCFMREMAINING_FR_Pos)            /**< (UHP_HCFMREMAINING) Frame remaining Mask */
#define UHP_HCFMREMAINING_FR(value)           (UHP_HCFMREMAINING_FR_Msk & ((value) << UHP_HCFMREMAINING_FR_Pos))
#define UHP_HCFMREMAINING_FRT_Pos             _U_(31)                                              /**< (UHP_HCFMREMAINING) Frame remaining toggle Position */
#define UHP_HCFMREMAINING_FRT_Msk             (_U_(0x1) << UHP_HCFMREMAINING_FRT_Pos)              /**< (UHP_HCFMREMAINING) Frame remaining toggle Mask */
#define UHP_HCFMREMAINING_FRT(value)          (UHP_HCFMREMAINING_FRT_Msk & ((value) << UHP_HCFMREMAINING_FRT_Pos))
#define UHP_HCFMREMAINING_Msk                 _U_(0x80003FFF)                                      /**< (UHP_HCFMREMAINING) Register Mask  */


/* -------- UHP_HCFMNUMBER : (UHP Offset: 0x3C) ( R/ 32) HC Frame Number Register -------- */
#define UHP_HCFMNUMBER_FN_Pos                 _U_(0)                                               /**< (UHP_HCFMNUMBER) Frame number Position */
#define UHP_HCFMNUMBER_FN_Msk                 (_U_(0xFFFF) << UHP_HCFMNUMBER_FN_Pos)               /**< (UHP_HCFMNUMBER) Frame number Mask */
#define UHP_HCFMNUMBER_FN(value)              (UHP_HCFMNUMBER_FN_Msk & ((value) << UHP_HCFMNUMBER_FN_Pos))
#define UHP_HCFMNUMBER_Msk                    _U_(0x0000FFFF)                                      /**< (UHP_HCFMNUMBER) Register Mask  */


