virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/uhp.h
/* -------- UHP_HCPERIODICSTART : (UHP Offset: 0x40) (R/W 32) HC Periodic Start Register -------- */
#define UHP_HCPERIODICSTART_PS_Pos            _U_(0)                                               /**< (UHP_HCPERIODICSTART) Periodic start Position */
#define UHP_HCPERIODICSTART_PS_Msk            (_U_(0x3FFF) << UHP_HCPERIODICSTART_PS_Pos)          /**< (UHP_HCPERIODICSTART) Periodic start Mask */
#define UHP_HCPERIODICSTART_PS(value)         (UHP_HCPERIODICSTART_PS_Msk & ((value) << UHP_HCPERIODICSTART_PS_Pos))
#define UHP_HCPERIODICSTART_Msk               _U_(0x00003FFF)                                      /**< (UHP_HCPERIODICSTART) Register Mask  */


/* -------- UHP_HCLSTHRESHOLD : (UHP Offset: 0x44) (R/W 32) HC Low-Speed Threshold Register -------- */
#define UHP_HCLSTHRESHOLD_LST_Pos             _U_(0)                                               /**< (UHP_HCLSTHRESHOLD) Low-speed threshold Position */
#define UHP_HCLSTHRESHOLD_LST_Msk             (_U_(0x3FFF) << UHP_HCLSTHRESHOLD_LST_Pos)           /**< (UHP_HCLSTHRESHOLD) Low-speed threshold Mask */
#define UHP_HCLSTHRESHOLD_LST(value)          (UHP_HCLSTHRESHOLD_LST_Msk & ((value) << UHP_HCLSTHRESHOLD_LST_Pos))
#define UHP_HCLSTHRESHOLD_Msk                 _U_(0x00003FFF)                                      /**< (UHP_HCLSTHRESHOLD) Register Mask  */


/* -------- UHP_HCRHDESCRIPTORA : (UHP Offset: 0x48) (R/W 32) HC Root Hub A Register -------- */
#define UHP_HCRHDESCRIPTORA_NDP_Pos           _U_(0)                                               /**< (UHP_HCRHDESCRIPTORA) Number of downstream ports (read-only) Position */
#define UHP_HCRHDESCRIPTORA_NDP_Msk           (_U_(0xFF) << UHP_HCRHDESCRIPTORA_NDP_Pos)           /**< (UHP_HCRHDESCRIPTORA) Number of downstream ports (read-only) Mask */
#define UHP_HCRHDESCRIPTORA_NDP(value)        (UHP_HCRHDESCRIPTORA_NDP_Msk & ((value) << UHP_HCRHDESCRIPTORA_NDP_Pos))
#define UHP_HCRHDESCRIPTORA_PSM_Pos           _U_(8)                                               /**< (UHP_HCRHDESCRIPTORA) Power switching mode (read/write) Position */
#define UHP_HCRHDESCRIPTORA_PSM_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORA_PSM_Pos)            /**< (UHP_HCRHDESCRIPTORA) Power switching mode (read/write) Mask */
#define UHP_HCRHDESCRIPTORA_PSM(value)        (UHP_HCRHDESCRIPTORA_PSM_Msk & ((value) << UHP_HCRHDESCRIPTORA_PSM_Pos))
#define UHP_HCRHDESCRIPTORA_NPS_Pos           _U_(9)                                               /**< (UHP_HCRHDESCRIPTORA) No power switching (read/write) Position */
#define UHP_HCRHDESCRIPTORA_NPS_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORA_NPS_Pos)            /**< (UHP_HCRHDESCRIPTORA) No power switching (read/write) Mask */
#define UHP_HCRHDESCRIPTORA_NPS(value)        (UHP_HCRHDESCRIPTORA_NPS_Msk & ((value) << UHP_HCRHDESCRIPTORA_NPS_Pos))
#define UHP_HCRHDESCRIPTORA_DT_Pos            _U_(10)                                              /**< (UHP_HCRHDESCRIPTORA) Device type (read-only) Position */
#define UHP_HCRHDESCRIPTORA_DT_Msk            (_U_(0x1) << UHP_HCRHDESCRIPTORA_DT_Pos)             /**< (UHP_HCRHDESCRIPTORA) Device type (read-only) Mask */
#define UHP_HCRHDESCRIPTORA_DT(value)         (UHP_HCRHDESCRIPTORA_DT_Msk & ((value) << UHP_HCRHDESCRIPTORA_DT_Pos))
#define UHP_HCRHDESCRIPTORA_OCPM_Pos          _U_(11)                                              /**< (UHP_HCRHDESCRIPTORA) Overcurrent protection mode (read/write) Position */
#define UHP_HCRHDESCRIPTORA_OCPM_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORA_OCPM_Pos)           /**< (UHP_HCRHDESCRIPTORA) Overcurrent protection mode (read/write) Mask */
#define UHP_HCRHDESCRIPTORA_OCPM(value)       (UHP_HCRHDESCRIPTORA_OCPM_Msk & ((value) << UHP_HCRHDESCRIPTORA_OCPM_Pos))
#define UHP_HCRHDESCRIPTORA_NOCP_Pos          _U_(12)                                              /**< (UHP_HCRHDESCRIPTORA) No overcurrent protection (read/write) Position */
#define UHP_HCRHDESCRIPTORA_NOCP_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORA_NOCP_Pos)           /**< (UHP_HCRHDESCRIPTORA) No overcurrent protection (read/write) Mask */
#define UHP_HCRHDESCRIPTORA_NOCP(value)       (UHP_HCRHDESCRIPTORA_NOCP_Msk & ((value) << UHP_HCRHDESCRIPTORA_NOCP_Pos))
#define UHP_HCRHDESCRIPTORA_POTPG_Pos         _U_(24)                                              /**< (UHP_HCRHDESCRIPTORA) Power-on to power-good time (read/write) Position */
#define UHP_HCRHDESCRIPTORA_POTPG_Msk         (_U_(0xFF) << UHP_HCRHDESCRIPTORA_POTPG_Pos)         /**< (UHP_HCRHDESCRIPTORA) Power-on to power-good time (read/write) Mask */
#define UHP_HCRHDESCRIPTORA_POTPG(value)      (UHP_HCRHDESCRIPTORA_POTPG_Msk & ((value) << UHP_HCRHDESCRIPTORA_POTPG_Pos))
#define UHP_HCRHDESCRIPTORA_Msk               _U_(0xFF001FFF)                                      /**< (UHP_HCRHDESCRIPTORA) Register Mask  */


/* -------- UHP_HCRHDESCRIPTORB : (UHP Offset: 0x4C) (R/W 32) HC Root Hub B Register -------- */
#define UHP_HCRHDESCRIPTORB_DR0_Pos           _U_(0)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR0_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR0_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR0(value)        (UHP_HCRHDESCRIPTORB_DR0_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR0_Pos))
#define UHP_HCRHDESCRIPTORB_DR1_Pos           _U_(1)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR1_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR1_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR1(value)        (UHP_HCRHDESCRIPTORB_DR1_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR1_Pos))
#define UHP_HCRHDESCRIPTORB_DR2_Pos           _U_(2)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR2_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR2_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR2(value)        (UHP_HCRHDESCRIPTORB_DR2_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR2_Pos))
#define UHP_HCRHDESCRIPTORB_DR3_Pos           _U_(3)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR3_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR3_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR3(value)        (UHP_HCRHDESCRIPTORB_DR3_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR3_Pos))
#define UHP_HCRHDESCRIPTORB_DR4_Pos           _U_(4)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR4_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR4_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR4(value)        (UHP_HCRHDESCRIPTORB_DR4_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR4_Pos))
#define UHP_HCRHDESCRIPTORB_DR5_Pos           _U_(5)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR5_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR5_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR5(value)        (UHP_HCRHDESCRIPTORB_DR5_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR5_Pos))
#define UHP_HCRHDESCRIPTORB_DR6_Pos           _U_(6)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR6_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR6_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR6(value)        (UHP_HCRHDESCRIPTORB_DR6_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR6_Pos))
#define UHP_HCRHDESCRIPTORB_DR7_Pos           _U_(7)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR7_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR7_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR7(value)        (UHP_HCRHDESCRIPTORB_DR7_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR7_Pos))
#define UHP_HCRHDESCRIPTORB_DR8_Pos           _U_(8)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR8_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR8_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR8(value)        (UHP_HCRHDESCRIPTORB_DR8_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR8_Pos))
#define UHP_HCRHDESCRIPTORB_DR9_Pos           _U_(9)                                               /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR9_Msk           (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR9_Pos)            /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR9(value)        (UHP_HCRHDESCRIPTORB_DR9_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR9_Pos))
#define UHP_HCRHDESCRIPTORB_DR10_Pos          _U_(10)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR10_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR10_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR10(value)       (UHP_HCRHDESCRIPTORB_DR10_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR10_Pos))
#define UHP_HCRHDESCRIPTORB_DR11_Pos          _U_(11)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR11_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR11_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR11(value)       (UHP_HCRHDESCRIPTORB_DR11_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR11_Pos))
#define UHP_HCRHDESCRIPTORB_DR12_Pos          _U_(12)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR12_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR12_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR12(value)       (UHP_HCRHDESCRIPTORB_DR12_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR12_Pos))
#define UHP_HCRHDESCRIPTORB_DR13_Pos          _U_(13)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR13_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR13_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR13(value)       (UHP_HCRHDESCRIPTORB_DR13_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR13_Pos))
#define UHP_HCRHDESCRIPTORB_DR14_Pos          _U_(14)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR14_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR14_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR14(value)       (UHP_HCRHDESCRIPTORB_DR14_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR14_Pos))
#define UHP_HCRHDESCRIPTORB_DR15_Pos          _U_(15)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_DR15_Msk          (_U_(0x1) << UHP_HCRHDESCRIPTORB_DR15_Pos)           /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_DR15(value)       (UHP_HCRHDESCRIPTORB_DR15_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR15_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM0_Pos         _U_(16)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM0_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM0_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM0(value)      (UHP_HCRHDESCRIPTORB_PPCM0_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM0_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM1_Pos         _U_(17)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM1_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM1_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM1(value)      (UHP_HCRHDESCRIPTORB_PPCM1_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM1_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM2_Pos         _U_(18)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM2_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM2_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM2(value)      (UHP_HCRHDESCRIPTORB_PPCM2_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM2_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM3_Pos         _U_(19)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM3_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM3_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM3(value)      (UHP_HCRHDESCRIPTORB_PPCM3_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM3_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM4_Pos         _U_(20)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM4_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM4_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM4(value)      (UHP_HCRHDESCRIPTORB_PPCM4_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM4_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM5_Pos         _U_(21)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM5_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM5_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM5(value)      (UHP_HCRHDESCRIPTORB_PPCM5_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM5_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM6_Pos         _U_(22)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM6_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM6_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM6(value)      (UHP_HCRHDESCRIPTORB_PPCM6_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM6_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM7_Pos         _U_(23)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM7_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM7_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM7(value)      (UHP_HCRHDESCRIPTORB_PPCM7_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM7_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM8_Pos         _U_(24)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM8_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM8_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM8(value)      (UHP_HCRHDESCRIPTORB_PPCM8_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM8_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM9_Pos         _U_(25)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM9_Msk         (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM9_Pos)          /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM9(value)      (UHP_HCRHDESCRIPTORB_PPCM9_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM9_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM10_Pos        _U_(26)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM10_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM10_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM10(value)     (UHP_HCRHDESCRIPTORB_PPCM10_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM10_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM11_Pos        _U_(27)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM11_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM11_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM11(value)     (UHP_HCRHDESCRIPTORB_PPCM11_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM11_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM12_Pos        _U_(28)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM12_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM12_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM12(value)     (UHP_HCRHDESCRIPTORB_PPCM12_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM12_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM13_Pos        _U_(29)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM13_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM13_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM13(value)     (UHP_HCRHDESCRIPTORB_PPCM13_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM13_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM14_Pos        _U_(30)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM14_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM14_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM14(value)     (UHP_HCRHDESCRIPTORB_PPCM14_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM14_Pos))
#define UHP_HCRHDESCRIPTORB_PPCM15_Pos        _U_(31)                                              /**< (UHP_HCRHDESCRIPTORB)  Position */
#define UHP_HCRHDESCRIPTORB_PPCM15_Msk        (_U_(0x1) << UHP_HCRHDESCRIPTORB_PPCM15_Pos)         /**< (UHP_HCRHDESCRIPTORB)  Mask */
#define UHP_HCRHDESCRIPTORB_PPCM15(value)     (UHP_HCRHDESCRIPTORB_PPCM15_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM15_Pos))
#define UHP_HCRHDESCRIPTORB_Msk               _U_(0xFFFFFFFF)                                      /**< (UHP_HCRHDESCRIPTORB) Register Mask  */

#define UHP_HCRHDESCRIPTORB_DR_Pos            _U_(0)                                               /**< (UHP_HCRHDESCRIPTORB Position)  */
#define UHP_HCRHDESCRIPTORB_DR_Msk            (_U_(0xFFFF) << UHP_HCRHDESCRIPTORB_DR_Pos)          /**< (UHP_HCRHDESCRIPTORB Mask) DR */
#define UHP_HCRHDESCRIPTORB_DR(value)         (UHP_HCRHDESCRIPTORB_DR_Msk & ((value) << UHP_HCRHDESCRIPTORB_DR_Pos)) 
#define UHP_HCRHDESCRIPTORB_PPCM_Pos          _U_(16)                                              /**< (UHP_HCRHDESCRIPTORB Position)  */
#define UHP_HCRHDESCRIPTORB_PPCM_Msk          (_U_(0xFFFF) << UHP_HCRHDESCRIPTORB_PPCM_Pos)        /**< (UHP_HCRHDESCRIPTORB Mask) PPCM */
#define UHP_HCRHDESCRIPTORB_PPCM(value)       (UHP_HCRHDESCRIPTORB_PPCM_Msk & ((value) << UHP_HCRHDESCRIPTORB_PPCM_Pos)) 

