virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/uhp.h
/* -------- UHP_HCRHSTATUS : (UHP Offset: 0x50) (R/W 32) HC Root Hub Status Register -------- */
#define UHP_HCRHSTATUS_LPS_Pos                _U_(0)                                               /**< (UHP_HCRHSTATUS) Local power status (read/write) Position */
#define UHP_HCRHSTATUS_LPS_Msk                (_U_(0x1) << UHP_HCRHSTATUS_LPS_Pos)                 /**< (UHP_HCRHSTATUS) Local power status (read/write) Mask */
#define UHP_HCRHSTATUS_LPS(value)             (UHP_HCRHSTATUS_LPS_Msk & ((value) << UHP_HCRHSTATUS_LPS_Pos))
#define UHP_HCRHSTATUS_OCI_Pos                _U_(1)                                               /**< (UHP_HCRHSTATUS) Overcurrent indicator (read-only) Position */
#define UHP_HCRHSTATUS_OCI_Msk                (_U_(0x1) << UHP_HCRHSTATUS_OCI_Pos)                 /**< (UHP_HCRHSTATUS) Overcurrent indicator (read-only) Mask */
#define UHP_HCRHSTATUS_OCI(value)             (UHP_HCRHSTATUS_OCI_Msk & ((value) << UHP_HCRHSTATUS_OCI_Pos))
#define UHP_HCRHSTATUS_DRWE_Pos               _U_(15)                                              /**< (UHP_HCRHSTATUS) Device remote wake-up enable (read/write) Position */
#define UHP_HCRHSTATUS_DRWE_Msk               (_U_(0x1) << UHP_HCRHSTATUS_DRWE_Pos)                /**< (UHP_HCRHSTATUS) Device remote wake-up enable (read/write) Mask */
#define UHP_HCRHSTATUS_DRWE(value)            (UHP_HCRHSTATUS_DRWE_Msk & ((value) << UHP_HCRHSTATUS_DRWE_Pos))
#define UHP_HCRHSTATUS_LPSC_Pos               _U_(16)                                              /**< (UHP_HCRHSTATUS) Local power status change (read/write) Position */
#define UHP_HCRHSTATUS_LPSC_Msk               (_U_(0x1) << UHP_HCRHSTATUS_LPSC_Pos)                /**< (UHP_HCRHSTATUS) Local power status change (read/write) Mask */
#define UHP_HCRHSTATUS_LPSC(value)            (UHP_HCRHSTATUS_LPSC_Msk & ((value) << UHP_HCRHSTATUS_LPSC_Pos))
#define UHP_HCRHSTATUS_OCIC_Pos               _U_(17)                                              /**< (UHP_HCRHSTATUS) Overcurrent indication change (read/write) Position */
#define UHP_HCRHSTATUS_OCIC_Msk               (_U_(0x1) << UHP_HCRHSTATUS_OCIC_Pos)                /**< (UHP_HCRHSTATUS) Overcurrent indication change (read/write) Mask */
#define UHP_HCRHSTATUS_OCIC(value)            (UHP_HCRHSTATUS_OCIC_Msk & ((value) << UHP_HCRHSTATUS_OCIC_Pos))
#define UHP_HCRHSTATUS_CRWE_Pos               _U_(31)                                              /**< (UHP_HCRHSTATUS) Clear remote wake-up enable (read/write) Position */
#define UHP_HCRHSTATUS_CRWE_Msk               (_U_(0x1) << UHP_HCRHSTATUS_CRWE_Pos)                /**< (UHP_HCRHSTATUS) Clear remote wake-up enable (read/write) Mask */
#define UHP_HCRHSTATUS_CRWE(value)            (UHP_HCRHSTATUS_CRWE_Msk & ((value) << UHP_HCRHSTATUS_CRWE_Pos))
#define UHP_HCRHSTATUS_Msk                    _U_(0x80038003)                                      /**< (UHP_HCRHSTATUS) Register Mask  */


/* -------- UHP_HCRHPORTSTATUS : (UHP Offset: 0x54) (R/W 32) HC Port 1 Status and Control Register 0 -------- */
#define UHP_HCRHPORTSTATUS_CCS_CPE_Pos        _U_(0)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_CCS_CPE_Msk        (_U_(0x1) << UHP_HCRHPORTSTATUS_CCS_CPE_Pos)         /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_CCS_CPE(value)     (UHP_HCRHPORTSTATUS_CCS_CPE_Msk & ((value) << UHP_HCRHPORTSTATUS_CCS_CPE_Pos))
#define UHP_HCRHPORTSTATUS_PES_SPE_Pos        _U_(1)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_PES_SPE_Msk        (_U_(0x1) << UHP_HCRHPORTSTATUS_PES_SPE_Pos)         /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_PES_SPE(value)     (UHP_HCRHPORTSTATUS_PES_SPE_Msk & ((value) << UHP_HCRHPORTSTATUS_PES_SPE_Pos))
#define UHP_HCRHPORTSTATUS_PSS_SPS_Pos        _U_(2)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_PSS_SPS_Msk        (_U_(0x1) << UHP_HCRHPORTSTATUS_PSS_SPS_Pos)         /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_PSS_SPS(value)     (UHP_HCRHPORTSTATUS_PSS_SPS_Msk & ((value) << UHP_HCRHPORTSTATUS_PSS_SPS_Pos))
#define UHP_HCRHPORTSTATUS_POCI_CSS_Pos       _U_(3)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_POCI_CSS_Msk       (_U_(0x1) << UHP_HCRHPORTSTATUS_POCI_CSS_Pos)        /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_POCI_CSS(value)    (UHP_HCRHPORTSTATUS_POCI_CSS_Msk & ((value) << UHP_HCRHPORTSTATUS_POCI_CSS_Pos))
#define UHP_HCRHPORTSTATUS_PRS_SPR_Pos        _U_(4)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_PRS_SPR_Msk        (_U_(0x1) << UHP_HCRHPORTSTATUS_PRS_SPR_Pos)         /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_PRS_SPR(value)     (UHP_HCRHPORTSTATUS_PRS_SPR_Msk & ((value) << UHP_HCRHPORTSTATUS_PRS_SPR_Pos))
#define UHP_HCRHPORTSTATUS_PPS_SPP_Pos        _U_(8)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_PPS_SPP_Msk        (_U_(0x1) << UHP_HCRHPORTSTATUS_PPS_SPP_Pos)         /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_PPS_SPP(value)     (UHP_HCRHPORTSTATUS_PPS_SPP_Msk & ((value) << UHP_HCRHPORTSTATUS_PPS_SPP_Pos))
#define UHP_HCRHPORTSTATUS_LSDA_CPP_Pos       _U_(9)                                               /**< (UHP_HCRHPORTSTATUS)  Position */
#define UHP_HCRHPORTSTATUS_LSDA_CPP_Msk       (_U_(0x1) << UHP_HCRHPORTSTATUS_LSDA_CPP_Pos)        /**< (UHP_HCRHPORTSTATUS)  Mask */
#define UHP_HCRHPORTSTATUS_LSDA_CPP(value)    (UHP_HCRHPORTSTATUS_LSDA_CPP_Msk & ((value) << UHP_HCRHPORTSTATUS_LSDA_CPP_Pos))
#define UHP_HCRHPORTSTATUS_CSC_Pos            _U_(16)                                              /**< (UHP_HCRHPORTSTATUS) Port 1 connect status change (read/write, write '1' to clear) Position */
#define UHP_HCRHPORTSTATUS_CSC_Msk            (_U_(0x1) << UHP_HCRHPORTSTATUS_CSC_Pos)             /**< (UHP_HCRHPORTSTATUS) Port 1 connect status change (read/write, write '1' to clear) Mask */
#define UHP_HCRHPORTSTATUS_CSC(value)         (UHP_HCRHPORTSTATUS_CSC_Msk & ((value) << UHP_HCRHPORTSTATUS_CSC_Pos))
#define UHP_HCRHPORTSTATUS_PESC_Pos           _U_(17)                                              /**< (UHP_HCRHPORTSTATUS) Port 1 enable status change (read/write, write '1' to clear) Position */
#define UHP_HCRHPORTSTATUS_PESC_Msk           (_U_(0x1) << UHP_HCRHPORTSTATUS_PESC_Pos)            /**< (UHP_HCRHPORTSTATUS) Port 1 enable status change (read/write, write '1' to clear) Mask */
#define UHP_HCRHPORTSTATUS_PESC(value)        (UHP_HCRHPORTSTATUS_PESC_Msk & ((value) << UHP_HCRHPORTSTATUS_PESC_Pos))
#define UHP_HCRHPORTSTATUS_PSSC_Pos           _U_(18)                                              /**< (UHP_HCRHPORTSTATUS) Port 1 suspend status change (read/write, write '1' to clear) Position */
#define UHP_HCRHPORTSTATUS_PSSC_Msk           (_U_(0x1) << UHP_HCRHPORTSTATUS_PSSC_Pos)            /**< (UHP_HCRHPORTSTATUS) Port 1 suspend status change (read/write, write '1' to clear) Mask */
#define UHP_HCRHPORTSTATUS_PSSC(value)        (UHP_HCRHPORTSTATUS_PSSC_Msk & ((value) << UHP_HCRHPORTSTATUS_PSSC_Pos))
#define UHP_HCRHPORTSTATUS_OCIC_Pos           _U_(19)                                              /**< (UHP_HCRHPORTSTATUS) Port 1 overcurrent indicator change (read/write) Position */
#define UHP_HCRHPORTSTATUS_OCIC_Msk           (_U_(0x1) << UHP_HCRHPORTSTATUS_OCIC_Pos)            /**< (UHP_HCRHPORTSTATUS) Port 1 overcurrent indicator change (read/write) Mask */
#define UHP_HCRHPORTSTATUS_OCIC(value)        (UHP_HCRHPORTSTATUS_OCIC_Msk & ((value) << UHP_HCRHPORTSTATUS_OCIC_Pos))
#define UHP_HCRHPORTSTATUS_PRSC_Pos           _U_(20)                                              /**< (UHP_HCRHPORTSTATUS) Port 1 reset status change (read/write, write '1' to clear) Position */
#define UHP_HCRHPORTSTATUS_PRSC_Msk           (_U_(0x1) << UHP_HCRHPORTSTATUS_PRSC_Pos)            /**< (UHP_HCRHPORTSTATUS) Port 1 reset status change (read/write, write '1' to clear) Mask */
#define UHP_HCRHPORTSTATUS_PRSC(value)        (UHP_HCRHPORTSTATUS_PRSC_Msk & ((value) << UHP_HCRHPORTSTATUS_PRSC_Pos))
#define UHP_HCRHPORTSTATUS_Msk                _U_(0x001F031F)                                      /**< (UHP_HCRHPORTSTATUS) Register Mask  */


/** \brief UHP register offsets definitions */
#define UHP_HCREVISION_REG_OFST        (0x00)              /**< (UHP_HCREVISION) OHCI Revision Number Register Offset */
#define UHP_HCCONTROL_REG_OFST         (0x04)              /**< (UHP_HCCONTROL) HC Operating Mode Register Offset */
#define UHP_HCCOMMANDSTATUS_REG_OFST   (0x08)              /**< (UHP_HCCOMMANDSTATUS) HC Command and Status Register Offset */
#define UHP_HCINTERRUPTSTATUS_REG_OFST (0x0C)              /**< (UHP_HCINTERRUPTSTATUS) HC Interrupt and Status Register Offset */
#define UHP_HCINTERRUPTENABLE_REG_OFST (0x10)              /**< (UHP_HCINTERRUPTENABLE) HC Interrupt Enable Register Offset */
#define UHP_HCINTERRUPTDISABLE_REG_OFST (0x14)              /**< (UHP_HCINTERRUPTDISABLE) HC Interrupt Disable Register Offset */
#define UHP_HCHCCA_REG_OFST            (0x18)              /**< (UHP_HCHCCA) HC HCCA Address Register Offset */
#define UHP_HCPERIODCURRENTED_REG_OFST (0x1C)              /**< (UHP_HCPERIODCURRENTED) HC Current Periodic Register Offset */
#define UHP_HCCONTROLHEADED_REG_OFST   (0x20)              /**< (UHP_HCCONTROLHEADED) HC Head Control Register Offset */
#define UHP_HCCONTROLCURRENTED_REG_OFST (0x24)              /**< (UHP_HCCONTROLCURRENTED) HC Current Control Register Offset */
#define UHP_HCBULKHEADED_REG_OFST      (0x28)              /**< (UHP_HCBULKHEADED) HC Head Bulk Register Offset */
#define UHP_HCBULKCURRENTED_REG_OFST   (0x2C)              /**< (UHP_HCBULKCURRENTED) HC Current Bulk Register Offset */
#define UHP_HCDONEHEAD_REG_OFST        (0x30)              /**< (UHP_HCDONEHEAD) HC Head Done Register Offset */
#define UHP_HCFMINTERVAL_REG_OFST      (0x34)              /**< (UHP_HCFMINTERVAL) HC Frame Interval Register Offset */
#define UHP_HCFMREMAINING_REG_OFST     (0x38)              /**< (UHP_HCFMREMAINING) HC Frame Remaining Register Offset */
#define UHP_HCFMNUMBER_REG_OFST        (0x3C)              /**< (UHP_HCFMNUMBER) HC Frame Number Register Offset */
#define UHP_HCPERIODICSTART_REG_OFST   (0x40)              /**< (UHP_HCPERIODICSTART) HC Periodic Start Register Offset */
#define UHP_HCLSTHRESHOLD_REG_OFST     (0x44)              /**< (UHP_HCLSTHRESHOLD) HC Low-Speed Threshold Register Offset */
#define UHP_HCRHDESCRIPTORA_REG_OFST   (0x48)              /**< (UHP_HCRHDESCRIPTORA) HC Root Hub A Register Offset */
#define UHP_HCRHDESCRIPTORB_REG_OFST   (0x4C)              /**< (UHP_HCRHDESCRIPTORB) HC Root Hub B Register Offset */
#define UHP_HCRHSTATUS_REG_OFST        (0x50)              /**< (UHP_HCRHSTATUS) HC Root Hub Status Register Offset */
#define UHP_HCRHPORTSTATUS_REG_OFST    (0x54)              /**< (UHP_HCRHPORTSTATUS) HC Port 1 Status and Control Register 0 Offset */
#define UHP_HCRHPORTSTATUS0_REG_OFST   (0x54)              /**< (UHP_HCRHPORTSTATUS0) HC Port 1 Status and Control Register 0 Offset */
#define UHP_HCRHPORTSTATUS1_REG_OFST   (0x58)              /**< (UHP_HCRHPORTSTATUS1) HC Port 1 Status and Control Register 0 Offset */

