virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/uhp.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UHP register API structure */
typedef struct
{
  __I   uint32_t                       UHP_HCREVISION;     /**< Offset: 0x00 (R/   32) OHCI Revision Number Register */
  __IO  uint32_t                       UHP_HCCONTROL;      /**< Offset: 0x04 (R/W  32) HC Operating Mode Register */
  __IO  uint32_t                       UHP_HCCOMMANDSTATUS; /**< Offset: 0x08 (R/W  32) HC Command and Status Register */
  __IO  uint32_t                       UHP_HCINTERRUPTSTATUS; /**< Offset: 0x0C (R/W  32) HC Interrupt and Status Register */
  __IO  uint32_t                       UHP_HCINTERRUPTENABLE; /**< Offset: 0x10 (R/W  32) HC Interrupt Enable Register */
  __IO  uint32_t                       UHP_HCINTERRUPTDISABLE; /**< Offset: 0x14 (R/W  32) HC Interrupt Disable Register */
  __IO  uint32_t                       UHP_HCHCCA;         /**< Offset: 0x18 (R/W  32) HC HCCA Address Register */
  __I   uint32_t                       UHP_HCPERIODCURRENTED; /**< Offset: 0x1C (R/   32) HC Current Periodic Register */
  __IO  uint32_t                       UHP_HCCONTROLHEADED; /**< Offset: 0x20 (R/W  32) HC Head Control Register */
  __IO  uint32_t                       UHP_HCCONTROLCURRENTED; /**< Offset: 0x24 (R/W  32) HC Current Control Register */
  __IO  uint32_t                       UHP_HCBULKHEADED;   /**< Offset: 0x28 (R/W  32) HC Head Bulk Register */
  __IO  uint32_t                       UHP_HCBULKCURRENTED; /**< Offset: 0x2C (R/W  32) HC Current Bulk Register */
  __I   uint32_t                       UHP_HCDONEHEAD;     /**< Offset: 0x30 (R/   32) HC Head Done Register */
  __IO  uint32_t                       UHP_HCFMINTERVAL;   /**< Offset: 0x34 (R/W  32) HC Frame Interval Register */
  __I   uint32_t                       UHP_HCFMREMAINING;  /**< Offset: 0x38 (R/   32) HC Frame Remaining Register */
  __I   uint32_t                       UHP_HCFMNUMBER;     /**< Offset: 0x3C (R/   32) HC Frame Number Register */
  __IO  uint32_t                       UHP_HCPERIODICSTART; /**< Offset: 0x40 (R/W  32) HC Periodic Start Register */
  __IO  uint32_t                       UHP_HCLSTHRESHOLD;  /**< Offset: 0x44 (R/W  32) HC Low-Speed Threshold Register */
  __IO  uint32_t                       UHP_HCRHDESCRIPTORA; /**< Offset: 0x48 (R/W  32) HC Root Hub A Register */
  __IO  uint32_t                       UHP_HCRHDESCRIPTORB; /**< Offset: 0x4C (R/W  32) HC Root Hub B Register */
  __IO  uint32_t                       UHP_HCRHSTATUS;     /**< Offset: 0x50 (R/W  32) HC Root Hub Status Register */
  __IO  uint32_t                       UHP_HCRHPORTSTATUS[2]; /**< Offset: 0x54 (R/W  32) HC Port 1 Status and Control Register 0 */
} uhp_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_UHP_COMPONENT_H_ */
